package curriculum_A;

public class Qes1_13 {

	public static void main(String[] args) {
		
		/**********************************************************************************
		* [概要] Qes1 ローカル変数として宣言
		* [詳細] 対象の型をローカル変数として宣言する
		**********************************************************************************/
		byte B;            // バイト型
        short S;           // 短整数型
        int I;             // 整数型
        long L;            // 長整数型
        float F;           // 単精度浮動小数点数型
        double D;          // 倍精度浮動小数点数型
        char C;            // 文字型
        String Str;        // 文字列型（参照型）
        boolean Bool;      // ブーリアン型
        
        /**********************************************************************************
		* [概要] Qes2 初期化
		* [詳細] 各ローカル変数をローカル内でそれぞれの初期値を代入して初期化する
		**********************************************************************************/
        B = 0;              // バイト型に0を代入
        S = 0;              // 短整数型に0を代入
        I = 0;              // 整数型に0を代入
        L = 0L;             // 長整数型に0Lを代入（Lをつけるのがポイント）
        F = 0.0f;           // 単精度浮動小数点型に0.0fを代入（fをつける）
        D = 0.0;            // 倍精度浮動小数点型に0.0を代入
        C = 'A';            // 文字型に 'A' を代入
        Str = "test";           // 文字列型に空文字列を代入
        Bool = false;       // ブーリアン型にfalseを代入
        
        /**********************************************************************************
		* [概要] Qes3 代入
		* [詳細] 初期化した変数に指定の値を代入する
		**********************************************************************************/
        B = 10;             // バイト型に 10 を代入
        S = 100;            // 短整数型に 100 を代入
        I = 1000;           // 整数型に 1000 を代入
        L = 10000L;         // 長整数型に 10000 を代入
        F = 9.5f;           // 単精度浮動小数点型に 9.5 を代入
        D = 10.5;           // 倍精度浮動小数点型に 10.5 を代入
        C = 'a';            // 文字型に 'a' を代入
        Str = "ハロー";     // 文字列型に "ハロー" を代入
        Bool = true;        // ブーリアン型に true を代入
        
        /**********************************************************************************
		* [概要] Qes4 出力
		* [詳細] 作成した変数を用いて指定の値を出力する
		**********************************************************************************/
        System.out.println(B + S + I);                           // 1110
        System.out.println(F + D);         	                      // 20
        System.out.println(C + " " + Str + " " + Bool);          // a ハロー true
        System.out.println(B + F + D + S + I);                      // 1130
        System.out.println(B * S * I  * L);                      // 100000000
        System.out.println(D / S);                               // 0.105
        System.out.println(B - S);                               // -90
        
        /**********************************************************************************
		* [概要] Qes5 ハローJAVA2023の出力
		* [詳細] 以下のコードを修正してハローJAVA2023と出力する
		**********************************************************************************/
        // String num="20";
        // int num1=23;
        // System.out.println("ハローJAVA"+(num+num1));
        int num =20;     // 文字列型を整数型に変換する
        int num1 =23;
        System.out.println("ハローJAVA"+(num+num1));
        
        /**********************************************************************************
		* [概要] Qes6 指定フォーマットの出力
		* [詳細] 以下の値をローカル変数を用いて以下の指定フォーマットを出力する
		**********************************************************************************/
        // 山田太郎 18歳 170.5cm 62.2kg 寿司
        /* ↓↓format↓↓
		「初めまして○○です」
		「年齢は○○歳です」
		「身長は○○cmです」
		「体重は○○kgです」
		「好きな食べ物は○○です」
		*/
        // 初期値の設定
        String name = "山田太郎";     // 名前（文字列）
        int age = 18;                // 年齢（整数型）
        double height = 170.5;       // 身長（cm, 倍精度浮動小数点数型）
        double weight = 62.2;        // 体重（kg, 倍精度浮動小数点数型）
        String food = "寿司";        // 好きな食べ物（文字列）

        // 出力
        System.out.println("初めまして" + name + "です");             // 名前を出力
        System.out.println("年齢は" + age + "歳です");               // 年齢を出力
        System.out.println("身長は" + height + "cmです");            // 身長を出力
        System.out.println("体重は" + weight + "kgです");            // 体重を出力
        System.out.println("好きな食べ物は" + food + "です");         // 好きな食べ物を出力
        
        /**********************************************************************************
		* [概要] Qes7 BMIの出力
		* [詳細] 上記のローカル変数を用いてBMIを出力する
		**********************************************************************************/
        // BMIの出力
        System.out.println(weight /((height / 100) * (height / 100)));  //  体重/(身長*身長)
    }
}